# Задача:
# Создайте игровое поле для "Сапёра" размером 10×10.
# Поле должно быть представлено в виде двумерного массива.
# Разместите 15 мин случайным образом (обозначьте их числом −1).
# Для каждой клетки без мины подсчитайте количество мин в соседних клетках.
# Визуализируйте:
# Само поле (где мины выделены красным).
# Поле с числами, где указано количество мин вокруг каждой клетки (для наглядности).
#
from random import randint
import random
import matplotlib.pyplot as plt

import numpy as np

m =[]
data = [
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
]

while len(m)!=15:
    a = randint(0,9)
    b = randint(0, 9)
    k =(a,b)

    if k not in m:
        m.append(k)
    data[a][b]=1
print(m, len(m))

for i in range (1,9):
    for j in range(1, 9):
        if data[i][j]==1:
            if data[i][j-1]!=1:
                data[i][j-1]+=0.2
            if data[i][j + 1] != 1:
                data[i][j + 1] += 0.2
            if data[i - 1][j + 1] != 1:
                data[i - 1][j + 1] += 0.2
            if data[i - 1][j] != 1:
                data[i - 1][j] += 0.2
            if data[i - 1][j - 1] != 1:
                data[i - 1][j - 1] += 0.2
            if data[i + 1][j] != 1:
                data[i + 1][j] += 0.2
            if data[i+1][j+1]!=1:
                data[i+1][j+1]+=0.2
            if data[i+1][j-1]!=1:
                data[i+1][j-1]+=0.2

for i in range(0,10):
    if data

plt.imshow(data, cmap='binary')


plt.show()

